## Plan Result (543: demo_frontdoor - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 4 to change, 7 to destroy.</code></pre>

* Update
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;AppReg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;AppReg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;AppReg&#34;]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;AppReg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;AppReg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;AppReg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;AppReg&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;AppReg&#34;]
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be updated in-place
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
      ~ body                    = jsonencode(
          ~ {
              ~ identity = {
                  ~ type = "None" -> "SystemAssigned"
                }
            }
        )
        id                      = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
        name                    = "sdshmcts-demo"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["AppReg"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "2025-09-03T09:55:52.7152924+00:00" -> (known after apply)
      ~ host_name                = "appreg.demo.apps.hmcts.net" -> "appreg.demo.platform.hmcts.net" # forces replacement
      ~ id                       = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/customDomains/AppReg" -> (known after apply)
        name                     = "AppReg"
      ~ validation_token         = "_r8gt0xwchmd4b39mdeo5l4ynq3uwrjb" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ tls {
          + cdn_frontdoor_secret_id = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["AppReg"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/customDomains/AppReg" -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/associations/AppReg" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["AppReg"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/customDomains/AppReg" -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/associations/AppReg" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["AppReg"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/originGroups/AppReg/origins/AppReg"
        name                           = "AppReg"
      ~ origin_host_header             = "appreg.demo.apps.hmcts.net" -> "appreg.demo.platform.hmcts.net"
        # (8 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["AppReg"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/customDomains/AppReg",
        ] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/AppReg"
        name                            = "AppReg"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["AppReg"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/customDomains/AppReg",
        ] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/AppRegHttpsRedirect"
        name                            = "AppRegHttpsRedirect"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["AppReg"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      ~ id                       = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/securityPolicies/AppRegdemoPremium-securityPolicy" -> (known after apply)
        name                     = "AppRegdemoPremium-securityPolicy"
        # (1 unchanged attribute hidden)

      ~ security_policies {
          ~ firewall {
                # (1 unchanged attribute hidden)

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = false -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/customDomains/AppReg" -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["AppReg"] must be replaced
-/+ resource "azurerm_dns_txt_record" "public_dns_record" {
      ~ fqdn                = "_dnsauth.appreg.demo.apps.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.appreg.demo" -> (known after apply)
      ~ name                = "_dnsauth.appreg.demo" -> "_dnsauth.appreg" # forces replacement
      - tags                = {} -> null
      ~ zone_name           = "apps.hmcts.net" -> "demo.platform.hmcts.net" # forces replacement
        # (2 unchanged attributes hidden)

      - record {
          - value = "_r8gt0xwchmd4b39mdeo5l4ynq3uwrjb" -> null
        }
      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      ~ id                      = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/sds-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsdemo/objectId/f8be4027-0ab1-438d-951f-5d820fbe929b" -> (known after apply)
      ~ object_id               = "f8be4027-0ab1-438d-951f-5d820fbe929b" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/sds-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsdemo/providers/Microsoft.Authorization/roleAssignments/8a2f4cf5-ee92-3852-8a4d-2f6f48e3efc3" -> (known after apply)
      ~ name                                   = "8a2f4cf5-ee92-3852-8a4d-2f6f48e3efc3" -> (known after apply)
      ~ principal_id                           = "f8be4027-0ab1-438d-951f-5d820fbe929b" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 4 to change, 7 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity has changed
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
        id                      = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
        name                    = "sdshmcts-demo"
      ~ output                  = jsonencode(
          ~ {
              - identity = {
                  - principalId = "f8be4027-0ab1-438d-951f-5d820fbe929b"
                  - tenantId    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                }
            }
        )
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":973,"Program":"tfcmt","SHA1":"","Target":"543: demo_frontdoor - TerraformPlanApply","Vars":{}} -->